<?php


$data = [
    'Б1-В1' => [
        'title' => 'В каком случае водитель совершит вынужденную остановку?',
        'img' => null,
        'answers' => [
            '1. Остановившись непосредственно перед пешеходным переходом, чтобы уступить дорогу пешеходу.',
            '2. Остановившись на проезжей части из-за технической неисправности транспортного средства.',
            '3. В обоих перечисленных случаях.'
        ],
        'right_answer' => 1,
        'comment' => '',
        'tags' => [],
    ],
    'Б1-В2' => [
        'title' => 'Разрешен ли Вам съезд на дорогу с грунтовым покрытием?',
        'img' => 'n1_2.jpg',
        'answers' => [
            '1. Разрешен.',
            '2. Разрешен только при технической неисправности транспортного средства.',
            '3. Запрещен.',
        ],
        'right_answer' => 0,
        'comment' => '',
        'tags' => [],
    ]

//'title' => 'В каком случае водитель совершит вынужденную остановку?',
//'title' => 'Разрешен ли Вам съезд на дорогу с грунтовым покрытием?',
//'title' => 'Можно ли Вам остановиться в указанном месте для посадки пассажира?',
//'title' => 'Какие из указанных знаков запрещают движение водителям мопедов?',
//'title' => 'Вы намерены повернуть налево. Где следует остановиться, чтобы уступить дорогу легковому автомобилю?',
//'title' => 'Что означает мигание зеленого сигнала светофора?',
//'title' => 'Водитель обязан подавать сигналы световыми указателями поворота (рукой)',
//'title' => 'Как Вам следует поступить при повороте направо?',
//'title' => 'По какой траектории Вам разрешено выполнить разворот?',
//'title' => 'С какой скоростью Вы можете продолжить движение вне населенного пункта по левой полосе на легковом автомобиле?',
//'title' => 'Можно ли водителю легкового автомобиля выполнить опережение грузовых автомобилей вне населенного пункта по такой траектории?',
//'title' => 'В каком случае водителю разрешается поставить автомобиль на стоянку в указанном месте?',
//'title' => 'При повороте направо Вы должны уступить дорогу:',
//'title' => 'Вы намерены проехать перекресток в прямом направлении. Кому Вы должны уступить дорогу?',
//'title' => 'Кому Вы обязаны уступить дорогу при повороте налево?',
//'title' => 'С какой максимальной скоростью можно продолжить движение за знаком?',
//'title' => 'Для перевозки людей на мотоцикле водитель должен иметь водительское удостоверение на право управления транспортными средствами:',
//'title' => 'При какой неисправности разрешается эксплуатация транспортного средства?',
//'title' => 'В случае, когда правые колеса автомобиля наезжают на неукрепленную влажную обочину, рекомендуется:',
//'title' => 'Что понимается под временем реакции водителя?',





];

header("Access-Control-Allow-Origin: *");
header('Content-Type: application/json');

$id = array_rand($data);
$b = $data[$id];
$b['id'] = $id;
echo json_encode($b);
