<?php


$data = [
    'Б1-В1' => [
        'title' => 'В каком случае водитель совершит вынужденную остановку?',
        'img' => null,
        'answers' => [
            '1. Остановившись непосредственно перед пешеходным переходом, чтобы уступить дорогу пешеходу.',
            '2. Остановившись на проезжей части из-за технической неисправности транспортного средства.',
            '3. В обоих перечисленных случаях.'
        ],
        'right_answer' => 1,
        'comment' => '',
        'tags' => [],
    ],
    'Б1-В2' => [
        'title' => 'Разрешен ли Вам съезд на дорогу с грунтовым покрытием?',
        'img' => 'n1_2.jpg',
        'answers' => [
            '1. Разрешен.',
            '2. Разрешен только при технической неисправности транспортного средства.',
            '3. Запрещен.',
        ],
        'right_answer' => 0,
        'comment' => '',
        'tags' => [],
    ]

];

header("Access-Control-Allow-Origin: *");
header('Content-Type: application/json');

$id = array_rand($data);
$b = $data[$id];
$b['id'] = $id;
echo json_encode($b);
